witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
			if (band >= 0)
			{
				TRX_setFrequency(TRX.BANDS_SAVED_SETTINGS[band].Freq, CurrentVFO());
				TRX_setMode(TRX.BANDS_SAVED_SETTINGS[band].Mode, CurrentVFO());
				TRX.LNA = TRX.BANDS_SAVED_SETTINGS[band].LNA;
				TRX.ATT = TRX.BANDS_SAVED_SETTINGS[band].ATT;
				TRX.ADC_Driver = TRX.BANDS_SAVED_SETTINGS[band].ADC_Driver;
				TRX.FM_SQL_threshold = TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold;
				TRX.ADC_PGA = TRX.BANDS_SAVED_SETTINGS[band].ADC_PGA;
				CurrentVFO()->DNR = TRX.BANDS_SAVED_SETTINGS[band].DNR;
				CurrentVFO()->AGC = TRX.BANDS_SAVED_SETTINGS[band].AGC;
			}
			LCD_UpdateQuery.TopButtons = true;
			LCD_UpdateQuery.FreqInfo = true;
		}

		PERIPH_FrontPanel.key_ab_prev = PERIPH_FrontPanel.key_ab;
		PERIPH_FrontPanel.key_tune_prev = PERIPH_FrontPanel.key_tune;
		PERIPH_FrontPanel.key_preatt_prev = PERIPH_FrontPanel.key_preatt;
		PERIPH_FrontPanel.key_fast_prev = PERIPH_FrontPanel.key_fast;
		PERIPH_FrontPanel.key_modep_prev = PERIPH_FrontPanel.key_modep;
		PERIPH_FrontPanel.key_moden_prev = PERIPH_FrontPanel.key_moden;
		PERIPH_FrontPanel.key_bandp_prev = PERIPH_FrontPanel.key_bandp;
		PERIPH_FrontPanel.key_bandn_prev = PERIPH_FrontPanel.key_bandn;
	}

	if (FRONTPanel_MCP3008_2_Enabled)
	{
		//MCP3008 - 2 (10bit - 1024values)
		mcp3008_value = PERIPH_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin); // MENU
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_menu = true;
		else
			PERIPH_FrontPanel.key_menu = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(1, AD2_CS_GPIO_Port, AD2_CS_Pin); // CLAR
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_clar = true;
		else
			PERIPH_FrontPanel.key_clar = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(2, AD2_CS_GPIO_Port, AD2_CS_Pin); // NOTCH
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_notch = true;
		else
			PERIPH_FrontPanel.key_notch = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(3, AD2_CS_GPIO_Port, AD2_CS_Pin); // A=B
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_a_set_b = true;
		else
			PERIPH_FrontPanel.key_a_set_b = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(4, AD2_CS_GPIO_Port, AD2_CS_Pin); // DNR
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_dnr = true;
		else
			PERIPH_FrontPanel.key_dnr = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(5, AD2_CS_GPIO_Port, AD2_CS_Pin); // AGC
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_agc = true;
		else
			PERIPH_FrontPanel.key_agc = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(6, AD2_CS_GPIO_Port, AD2_CS_Pin); // AF_GAIN
		TRX_Volume = (uint16_t)(1023.0f - mcp3008_value);

		mcp3008_value = PERIPH_ReadMCP3008_Value(7, AD2_CS_GPIO_Port, AD2_CS_Pin); // SHIFT или IF Gain
		if(TRX.ShiftEnabled)
		{
			TRX_SHIFT = (int_fast16_t)(((1023.0f - mcp3008_value) * TRX.SHIFT_INTERVAL * 2 / 1023.0f) - TRX.SHIFT_INTERVAL);
			//if (abs(TRX_SHIFT) < (TRX.SHIFT_INTERVAL / 10.0f)) //при минимальных отклонениях - игнорируем
				//TRX_SHIFT = 0;
		}
		else
		{
			TRX_SHIFT = 0;
			TRX.IF_Gain = (uint8_t)(30.0f + ((1023.0f - mcp3008_value) * 50.0f / 1023.0f));
		}

		//F1 AGC
		if (PERIPH_FrontPanel.key_agc_prev != PERIPH_FrontPanel.key_agc && PERIPH_FrontPanel.key_agc && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_agc_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_agc_afterhold = false;
		}
		//F1 AGC HOLD - RF-POWER
		if (PERIPH_FrontPanel.key_agc_prev == PERIPH_FrontPanel.key_agc && PERIPH_FrontPanel.key_agc && (HAL_GetTick() - PERIPH_FrontPanel.key_agc_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_agc_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_agc_afterhold = true;

			if (!LCD_systemMenuOpened)
			{
				LCD_systemMenuOpened = true;
				SYSMENU_RFPOWER_HOTKEY();
				drawSystemMenu(true);
			}
			else
			{
				eventCloseSystemMenu();
				eventCloseSystemMenu();
			}
			LCD_redraw();
		}
		//F1 AGC CLICK
		if (PERIPH_FrontPanel.key_agc_prev != PERIPH_FrontPanel.key_agc && !PERIPH_FrontPanel.key_agc && (HAL_GetTick() - PERIPH_FrontPanel.key_agc_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_agc_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			CurrentVFO()->AGC = !CurrentVFO()->AGC;
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			if(band>0)
				TRX.BANDS_SAVED_SETTINGS[band].AGC = CurrentVFO()->AGC;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}

		//F2 DNR
		if (PERIPH_FrontPanel.key_dnr_prev != PERIPH_FrontPanel.key_dnr && PERIPH_FrontPanel.key_dnr && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_dnr_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_dnr_afterhold = false;
		}
		//F2 DNR HOLD - KEY WPM
		if (PERIPH_FrontPanel.key_dnr_prev == PERIPH_FrontPanel.key_dnr && PERIPH_FrontPanel.key_dnr && (HAL_GetTick() - PERIPH_FrontPanel.key_dnr_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_dnr_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_dnr_afterhold = true;

			if (!LCD_systemMenuOpened)
			{
				LCD_systemMenuOpened = true;
				SYSMENU_CW_WPM_HOTKEY();
				drawSystemMenu(true);
			}
			else
			{
				eventCloseSystemMenu();
				eventCloseSystemMenu();
			}
			LCD_redraw();
		}
		//F2 DNR CLICK
		if (PERIPH_FrontPanel.key_dnr_prev != PERIPH_FrontPanel.key_dnr && !PERIPH_FrontPanel.key_dnr && (HAL_GetTick() - PERIPH_FrontPanel.key_dnr_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_dnr_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			CurrentVFO()->DNR = !CurrentVFO()->DNR;
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			if(band>0)
				TRX.BANDS_SAVED_SETTINGS[band].DNR = CurrentVFO()->DNR;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}

		//F3 A=B
		if (PERIPH_FrontPanel.key_a_set_b_prev != PERIPH_FrontPanel.key_a_set_b && PERIPH_FrontPanel.key_a_set_b && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_a_set_b_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_a_set_b_afterhold = false;
		}
		//F3 A=B HOLD - KEY WPM
		if (PERIPH_FrontPanel.key_a_set_b_prev == PERIPH_FrontPanel.key_a_set_b && PERIPH_FrontPanel.key_a_set_b && (HAL_GetTick() - PERIPH_FrontPanel.key_a_set_b_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_a_set_b_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_a_set_b_afterhold = true;

			if (!LCD_systemMenuOpened)
			{
				LCD_systemMenuOpened = true;
				if (CurrentVFO()->Mode == TRX_MODE_CW_L || CurrentVFO()->Mode == TRX_MODE_CW_U)
					SYSMENU_AUDIO_CW_HOTKEY();
				else if (CurrentVFO()->Mode == TRX_MODE_NFM || CurrentVFO()->Mode == TRX_MODE_WFM)
					SYSMENU_AUDIO_FM_HOTKEY();
				else if (CurrentVFO()->Mode == TRX_MODE_AM)
					SYSMENU_AUDIO_AM_HOTKEY();
				else
					SYSMENU_AUDIO_SSB_HOTKEY();
				drawSystemMenu(true);
			}
			else
			{
				eventCloseSystemMenu();
				eventCloseSystemMenu();
			}
			LCD_redraw();
		}
		//F3 A=B CLICK
		if (PERIPH_FrontPanel.key_a_set_b_prev != PERIPH_FrontPanel.key_a_set_b && !PERIPH_FrontPanel.key_a_set_b && (HAL_GetTick() - PERIPH_FrontPanel.key_a_set_b_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_a_set_b_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			if (TRX.current_vfo)
			{
				TRX.VFO_A.LPF_Filter_Width = TRX.VFO_B.LPF_Filter_Width;
				TRX.VFO_A.HPF_Filter_Width = TRX.VFO_B.HPF_Filter_Width;
				TRX.VFO_A.Freq = TRX.VFO_B.Freq;
				TRX.VFO_A.Mode = TRX.VFO_B.Mode;
			}
			else
			{
				TRX.VFO_B.LPF_Filter_Width = TRX.VFO_A.LPF_Filter_Width;
				TRX.VFO_B.HPF_Filter_Width = TRX.VFO_A.HPF_Filter_Width;
				TRX.VFO_B.Freq = TRX.VFO_A.Freq;
				TRX.VFO_B.Mode = TRX.VFO_A.Mode;
			}
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}

		//F4 NOTCH
		if (PERIPH_FrontPanel.key_notch_prev != PERIPH_FrontPanel.key_notch && PERIPH_FrontPanel.key_notch && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_notch_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_notch_afterhold = false;
		}
		//F4 NOTCH HOLD - ENABLE MENUAL NOTCH
		if (PERIPH_FrontPanel.key_notch_prev == PERIPH_FrontPanel.key_notch && PERIPH_FrontPanel.key_notch && (HAL_GetTick() - PERIPH_FrontPanel.key_notch_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_notch_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_notch_afterhold = true;

			if (CurrentVFO()->NotchFC > CurrentVFO()->LPF_Filter_Width)
				CurrentVFO()->NotchFC = CurrentVFO()->LPF_Filter_Width;
			CurrentVFO()->AutoNotchFilter = false;
			if (!CurrentVFO()->ManualNotchFilter)
				CurrentVFO()->ManualNotchFilter = true;
			else
				CurrentVFO()->ManualNotchFilter = false;

			NeedReinitNotch = true;
			LCD_UpdateQuery.StatusInfoGUI = true;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//F4 NOTCH CLICK
		if (PERIPH_FrontPanel.key_notch_prev != PERIPH_FrontPanel.key_notch && !PERIPH_FrontPanel.key_notch && (HAL_GetTick() - PERIPH_FrontPanel.key_notch_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_notch_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			if (CurrentVFO()->NotchFC > CurrentVFO()->LPF_Filter_Width)
				CurrentVFO()->NotchFC = CurrentVFO()->LPF_Filter_Width;
			CurrentVFO()->ManualNotchFilter = false;
			if (!CurrentVFO()->AutoNotchFilter)
				CurrentVFO()->AutoNotchFilter = true;
			else
				CurrentVFO()->AutoNotchFilter = false;

			NeedReinitNotch = true;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}

