witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
		//F5 CLAR
		if (PERIPH_FrontPanel.key_clar_prev != PERIPH_FrontPanel.key_clar && PERIPH_FrontPanel.key_clar && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_clar_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_clar_afterhold = false;
		}
		//F5 CLAR HOLD - ENABLE SHIFT
		if (PERIPH_FrontPanel.key_clar_prev == PERIPH_FrontPanel.key_clar && PERIPH_FrontPanel.key_clar && (HAL_GetTick() - PERIPH_FrontPanel.key_clar_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_clar_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_clar_afterhold = true;

			TRX.ShiftEnabled = !TRX.ShiftEnabled;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//F5 CLAR CLICK
		if (PERIPH_FrontPanel.key_clar_prev != PERIPH_FrontPanel.key_clar && !PERIPH_FrontPanel.key_clar && (HAL_GetTick() - PERIPH_FrontPanel.key_clar_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_clar_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			TRX.CLAR = !TRX.CLAR;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}

		//F6 MENU
		if (PERIPH_FrontPanel.key_menu_prev != PERIPH_FrontPanel.key_menu && PERIPH_FrontPanel.key_menu)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_menu_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_menu_afterhold = false;
		}
		//F6 MENU HOLD - LOCK
		if (PERIPH_FrontPanel.key_menu_prev == PERIPH_FrontPanel.key_menu && PERIPH_FrontPanel.key_menu && (HAL_GetTick() - PERIPH_FrontPanel.key_menu_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_menu_afterhold)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_menu_afterhold = true;

			if (!LCD_systemMenuOpened)
				TRX.Locked = !TRX.Locked;
			else
			{
				sysmenu_hiddenmenu_enabled = true;
				LCD_redraw();
			}
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//F6 MENU CLICK
		if (PERIPH_FrontPanel.key_menu_prev != PERIPH_FrontPanel.key_menu && !PERIPH_FrontPanel.key_menu && (HAL_GetTick() - PERIPH_FrontPanel.key_menu_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_menu_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			if (!LCD_systemMenuOpened)
				LCD_systemMenuOpened = true;
			else
				eventCloseSystemMenu();
			LCD_redraw();
		}
		//

		PERIPH_FrontPanel.key_agc_prev = PERIPH_FrontPanel.key_agc;
		PERIPH_FrontPanel.key_dnr_prev = PERIPH_FrontPanel.key_dnr;
		PERIPH_FrontPanel.key_a_set_b_prev = PERIPH_FrontPanel.key_a_set_b;
		PERIPH_FrontPanel.key_notch_prev = PERIPH_FrontPanel.key_notch;
		PERIPH_FrontPanel.key_clar_prev = PERIPH_FrontPanel.key_clar;
		PERIPH_FrontPanel.key_menu_prev = PERIPH_FrontPanel.key_menu;
	}
	PERIPH_SPI_process = false;
}

void PERIPH_ProcessSWRMeter(void)
{
	float32_t forward = HAL_ADCEx_InjectedGetValue(&hadc1, ADC_INJECTED_RANK_2) * TRX_STM32_VREF / 65535.0f;
	float32_t backward = HAL_ADCEx_InjectedGetValue(&hadc1, ADC_INJECTED_RANK_1) * TRX_STM32_VREF / 65535.0f;

	forward = forward / (510.0f / (0.1f + 510.0f)); //корректируем напряжение исходя из делителя напряжения (0.1ом и 510ом)
	if (forward < 0.01f)	 //меньше 10mV не измеряем
	{
		TRX_SWR_forward = 0.0f;
		TRX_SWR_backward = 0.0f;
		TRX_SWR = 1.0f;
		return;
	}

	forward += 0.62f;			// падение на диоде
	forward = forward * CALIBRATE.swr_trans_rate; // Коэффициент трансформации КСВ метра

	backward = backward / (510.0f / (0.1f + 510.0f)); //корректируем напряжение исходя из делителя напряжения (0.1ом и 510ом)
	if (backward >= 0.01f)	 //меньше 10mV не измеряем
	{
		backward += 0.62f;			  // падение на диоде
		backward = backward * CALIBRATE.swr_trans_rate; //Коэффициент трансформации КСВ метра
	}
	else
		backward = 0.001f;

	TRX_SWR_forward = TRX_SWR_forward + (forward - TRX_SWR_forward) / 2;
	TRX_SWR_backward = TRX_SWR_backward + (backward - TRX_SWR_backward) / 2;
	TRX_SWR = (TRX_SWR_forward + TRX_SWR_backward) / (TRX_SWR_forward - TRX_SWR_backward);
	if (TRX_SWR_backward > TRX_SWR_forward)
		TRX_SWR = 10.0f;
	if (TRX_SWR > 10.0f)
		TRX_SWR = 10.0f;
	float32_t ref_power = (TRX_SWR_backward * TRX_SWR_backward) / 50.0f;

	LCD_UpdateQuery.StatusInfoBar = true;
	if (TRX_SWR >= SWR_CRITICAL && ref_power > 1.0f && CurrentVFO()->Mode != TRX_MODE_LOOPBACK) //опасный порог КСВ, отключаем передачу
	{
		TRX_Time_InActive = 0;
		TRX_Tune = false;
		TRX_ptt_hard = false;
		TRX_ptt_cat = false;
		TRX_Restart_Mode();
		NeedSaveSettings = true;
		LCD_UpdateQuery.StatusInfoGUI = true;
		LCD_UpdateQuery.TopButtons = true;
	}
}

static uint16_t PERIPH_ReadMCP3008_Value(uint8_t channel, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN)
{
	uint8_t outData[3] = {0};
	uint8_t inData[3] = {0};
	uint16_t mcp3008_value = 0;

	outData[0] = 0x18 | channel;
	bool res = PERIPH_SPI_Transmit(outData, inData, 3, CS_PORT, CS_PIN, false);
	if (res == false)
		return 65535;
	mcp3008_value = (uint16_t)(0 | ((inData[1] & 0x3F) << 4) | (inData[2] & 0xF0 >> 4));

	return mcp3008_value;
}

bool PERIPH_SPI_Transmit(uint8_t *out_data, uint8_t *in_data, uint8_t count, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN, bool hold_cs)
{
	if (PERIPH_SPI_busy)
	{
		sendToDebug_strln("SPI Busy");
		return false;
	}
	const int32_t timeout = HAL_MAX_DELAY;
	PERIPH_SPI_busy = true;
	HAL_IWDG_Refresh(&hiwdg1);
	memset(in_data, 0x00, count);
	HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_RESET);
	HAL_StatusTypeDef res = 0;
	if(in_data==NULL)
	{
		res = HAL_SPI_Transmit(&hspi2, out_data, count, timeout);
	}
	else if(out_data==NULL)
	{
		res = HAL_SPI_Receive(&hspi2, in_data, count, timeout);
	}
	else
	{
		res = HAL_SPI_TransmitReceive(&hspi2, out_data, in_data, count, timeout);
	}
	if(!hold_cs)
		HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_SET);
	PERIPH_SPI_busy = false;
	if (res == HAL_TIMEOUT || res == HAL_ERROR)
		return false;
	else
		return true;
}
